{
  "display": {
    "icon": {
      "item": "botania:elementium_ingot"
    },
    "title": "Elementium Ingot",
    "description": "Toss two manasteel into an elven portal to obtain elementium.\n\nSimilarly to other metals, Elementium can be shaped into tools and armor.\n\nThe respective armor components each have decent damage resistances (same as manasteel armor), as well as the ability to drain Mana to heal damage.\n\nEach piece of armor will, when its bearer is harmed, have a chance to spawn a Pixie to fly after the aggressor, dealing some decent damage.\n\nThe more pieces of Elementium Armor equipped, the higher the chance becomes. Additionally, each of the tools in the set comes with its own unique ability.\n\nFirst, the Elementium Pickaxe will clear away Cobblestone, Dirt, Netherrack, and other common materials, leaving behind only ores and fine resources. Certain blocks are considered semi-disposable, meaning they won\u0027t be voided when broken while sneaking.\n\nCombining the Elementium Pickaxe with a Terra Shatterer in a crafting square allows for the latter to take on the former\u0027s power. This can\u0027t be undone.\n\n\nThe Elementium Shovel will, if the block broken is affected by gravity (Gravel, Sand, etc), also destroy all blocks of that material above/below it. No more gravel falling while mining!\n\n\nThe Elementium Axe doubles as a weapon. If used to deal the finishing blow to any Zombie or Skeleton variant, Creeper, Piglin, or other Player, it may decapitate its victim, leaving a severed head or skull behind.\n\nUnlike usual axes, the Elementium Axe supports the Looting enchantment, which will increase the chance of skull drops.\n\n\nThe Elementium Hoe will instantly moisten farmland it creates, regardless of proximity to water, or whether water can even exist in the vicinity. Perfect for impatient farmers!\n\n\nThe Elementium Shears can, when drawn back like a bow, speedily shear nearby sheep within a large area of effect centered on the holder.\n\n\nFinally, the Elementium Sword, when held, increases the chance of a Pixie spawning when hit (this holds true even when no Elementium Armor is worn), and augments the strength of any Pixies spawned.",
    "frame": "task",
    "show_toast": true,
    "announce_to_chat": true,
    "hidden": false
  },
  "parent": "aprandomizer:archipelago/quest_terrasteel_ingot",
  "criteria": {
    "impossible": {
      "trigger": "minecraft:impossible"
    }
  }
}